# IFCImportOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCImportOptions Class
Members See Also
---
IFC Import options.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class IFCImportOptions : IDisposable
```

Visual Basic
---
```text
Public Class IFCImportOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCImportOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCImportOptions
# See Also
IFCImportOptions Members
Autodesk.Revit.DB.IFC Namespace